[
    {
      "project_id": "01",
      "name": "DevLearn",
      "sh_des": "Course Purchasing Web App",
      "live_site": "https://devlearn-afc3d.web.app/",
      "client_repo": "https://github.com/Aqibaman/devlearn-client",
      "server_repo": "https://github.com/Aqibaman/devlearn-server",
      "img1": "https://i.ibb.co/0Jf71vb/a1.png",
      "img2": "https://i.ibb.co/tPhFg8Z/a2.png",
      "img3": "https://i.ibb.co/8bYGpdT/a3.png",
      "des1": "This project is build on helping people learning code efficiently. It is a course platform where people cn purchase premium courses. This platform will help them to build knowledge in coding languages.",
      "title2": "Modern DevLearn Courses Page",
      "title3": "Premium Course Purchase Page",
      "des2": "There are several web development resources available in this project. Courses like these are invaluable for educating ourselves on the many facets of web design and development. Taking a DevLearn course will allow us to save money for more advanced training. You're really welcome!",
      "des3": "Each course here has a link that, when clicked, will take you to a page where you can pay for full access to that course. If a student has access to this premium course, they can use this site to hone their development skills.",
      "des4": "Overall, you can expect to learn more about creating a premium course website from scratch due to this work. This project will teach you the fundamentals of creating a functional e - learning systems.",
      "des5": "Technology such as Basic Firebase Authentication and Tailwind CSS were used to create this item. Node.js is used in the backend to establish a connection between the database and the user interface."
    },
    {
      "project_id": "02",
      "name": "Aqib Aman Academy",
      "sh_des": "Training Review Web App",
      "live_site": "https://aqib-aman-academy.web.app/",
      "client_repo": "https://github.com/Aqibaman/aqib-aman-academy-client",
      "server_repo": "https://github.com/Aqibaman/aqib-aman-academy-server",
      "img1": "https://i.ibb.co/tMSRCWD/b1.png",
      "img2": "https://i.ibb.co/W53hcDT/b2.png",
      "img3": "https://i.ibb.co/0B2cXxL/b3.png",
      "des1": "This project is based on analyzing several trainings. Here, you can add trainings for others to review. When you click on a training, you can browse all reviews.",
      "title2": "All Supply Chain Trainings Page",
      "title3": "All Reviews of Each Training",
      "des2": "Here you will find all the specialized trainings for a supply chain platform, as well as reviews of this platform. Additionally, they can upload trainings upon which others can provide feedback.",
      "des3": "You can review specific courses on this platform, which will be presented to logged-in users. This platform will assist users in deciding whether to purchase a course based on ratings and reviews.",
      "des4": "This platform will assist users and viewers comprehend each course's rating, and based on those ratings, they will be able to determine which course to purchase. Thank you very much!",
      "des5": "Utilizing technologies such as Tailwind CSS, Basic JWT, Firebase Authentication, and many others, this project was developed.In addition, we employ NodeJS backend and MongoDB databases to execute CRUD operations."
    },
    {
      "project_id": "03",
      "name": "Book House",
      "sh_des": "Used Book-selling Web App",
      "live_site": "https://bookhouse-ed4d1.web.app/",
      "client_repo": "https://github.com/Aqibaman/bookhouse-client",
      "server_repo": "https://github.com/Aqibaman/bookhouse-server",
      "img1": "https://i.ibb.co/NY7Dy0k/c1.png",
      "img2": "https://i.ibb.co/PQmh8TF/c2.png",
      "img3": "https://i.ibb.co/VDXQRpk/c3.png",
      "des1": "This project is designed to assist individuals in purchasing used books via a digital platform at the lowest possible price. Here, we provide an admin dashboard where customers, sellers, and admins can be readily monitored.",
      "title2": "Categorycally All Books Page",
      "title3": "Dashboard for Buyers, Sellers & Admin",
      "des2": "All books can be located through their respective category pages. You can reserve these books from each of their category pages and pay for them using stripe.",
      "des3": "Here you will find all of our dashboards, where you can view all vendors, buyers, and administrators in their separate accounts. Each has a unique responsibility and control over a unique set of variables through their dashboard.",
      "des4": "In a word, our initiative will enable individuals to enter a knowledge pool at the lowest cost and enjoy the platform tremendously. People can buy and sell books with relative ease.",
      "des5": "Context API, TanStack Query, React Hook Form, JWT, and Firebase Authentication are just a few of the technologies utilized in the construction of this application. We merged data from the MongoDB and Node backend databases. We also utilize the Stripe payment mechanism to develop this application."
    }
  ]